title: Mimikatz Command Line Indicators
id: a4cd2e0f-7b9a-9a0c-eb8d-d2e7f8a9b0c1
status: test
description: Detects Mimikatz execution via command line arguments
references:
  - https://github.com/gentilkiwi/mimikatz
author: Credential Defense
date: 2024-04-01
tags:
  - attack.credential_access
  - attack.t1003.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_cli:
    CommandLine|contains:
      - 'sekurlsa::logonpasswords'
      - 'lsadump::sam'
      - 'lsadump::lsa'
      - 'privilege::debug'
      - 'token::elevate'
  selection_image:
    Image|endswith: '\mimikatz.exe'
  condition: 1 of selection_*
falsepositives:
  - Penetration testing activities
level: critical
